FemDesign.Loads.LoadCase
load_case_type

FemDesign.Loads.LoadCase.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.LoadCase.#ctor(System.String,FemDesign.Loads.LoadCaseType,FemDesign.Loads.LoadCaseDuration)
Create a LoadCase
name: Name/Identifier of LoadCase.
type: One of "static", "dead_load", "shrinkage", "seis_max", "seis_sxp", "seis_sxm", "seis_syp", "seis_sym", "soil_dead_load", "prestressing", "fire", "deviation", "notional".
durationClass: One of "permanent", "long-term", "medium-term", "short-term", "instantaneous".

FemDesign.Loads.LoadCase.LoadCaseFromListByName(System.Collections.Generic.List{FemDesign.Loads.LoadCase},System.String)
Returns a LoadCase from a list of LoadCases by name. The first LoadCase with a matching name will be returned.
Remarks: Create
loadCases: List of LoadCase.
name: Name of LoadCase.